Revit 2027 API
IFCProductWrapper.AddSpace Method
 Adds an IfcSpace handle to associate with the IfcProduct in this wrapper.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddSpace(
	IFCAnyHandle spaceHandle,
	IFCLevelInfo pLevelInfo,
	IFCExtrusionCreationData pParams,
	bool relateToLevel
)
Public Sub AddSpace (
	spaceHandle As IFCAnyHandle,
	pLevelInfo As IFCLevelInfo,
	pParams As IFCExtrusionCreationData,
	relateToLevel As Boolean
)
public:
void AddSpace(
	IFCAnyHandle^ spaceHandle,
	IFCLevelInfo^ pLevelInfo,
	IFCExtrusionCreationData^ pParams,
	bool relateToLevel
)
member AddSpace :
        spaceHandle : IFCAnyHandle *
        pLevelInfo : IFCLevelInfo *
        pParams : IFCExtrusionCreationData *
        relateToLevel : bool -> unit
Parameters
spaceHandle IFCAnyHandle
 The IfcSpace handle.
pLevelInfo IFCLevelInfo
 Information on the associated level.
pParams IFCExtrusionCreationData
 The extrusion creation data associated with the given space. Optional, can be null.
relateToLevel Boolean
 True to relate the space to the level, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 If the IFCLevelInfo is not provided, and relateToLevel to true, the handle will be associated to the building handle.
See Also
Reference
IFCProductWrapper Class
Autodesk.Revit.DB.IFC Namespace